#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/hamacorp/learn-terraform-staging/runs/run-E3NqrZPdmH8f9asu

Waiting for the plan to start...

Terraform v1.1.6
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.subnet.aws_subnet.private_db_subnet_c: Refreshing state... [id=subnet-0f4c2b6a6d64eb3a0]
module.subnet.aws_subnet.private_db_subnet_b: Refreshing state... [id=subnet-091034298968c903a]
module.nacl.aws_network_acl.network_acl_private_db_subnet_a: Refreshing state... [id=acl-0abd79b3f151ae1fe]
module.subnet.aws_subnet.public_subnet_b: Refreshing state... [id=subnet-0d875761e968b6dfc]
module.nacl.aws_network_acl.network_acl_vpc: Refreshing state... [id=acl-028ddc3a37f331e01]
module.nacl.aws_network_acl.network_acl_private_network_subnet_a: Refreshing state... [id=acl-0e341455acfc523da]
module.subnet.aws_subnet.public_subnet_c: Refreshing state... [id=subnet-0d4d72d0aaf2e144d]
module.subnet.aws_subnet.public_subnet_a: Refreshing state... [id=subnet-005510955b3598a08]
module.nacl.aws_network_acl.network_acl_private_app_subnet_b: Refreshing state... [id=acl-0d9d1dbec0a8521fd]
module.subnet.aws_subnet.private_app_subnet_c: Refreshing state... [id=subnet-0e3375e07d7b2ee83]
module.subnet.aws_subnet.private_network_subnet_a: Refreshing state... [id=subnet-0a2d0351da9e992c1]
module.vpc.aws_vpc.controltower_vpc: Refreshing state... [id=vpc-01908caf7c73d412a]
module.subnet.aws_subnet.private_network_subnet_c: Refreshing state... [id=subnet-0d2fdb3dacb6963d8]
module.nacl.aws_network_acl.network_acl_public_subnet_c: Refreshing state... [id=acl-0efd8c5591b602e4d]
module.nacl.aws_network_acl.network_acl_public_subnet_b: Refreshing state... [id=acl-072f4ac4eb19b9d21]
module.nacl.aws_network_acl.network_acl_private_network_subnet_b: Refreshing state... [id=acl-0a327d4c5b4c7206b]
module.nacl.aws_network_acl.network_acl_private_app_subnet_a: Refreshing state... [id=acl-0356c8c1c2820b79f]
module.subnet.aws_subnet.private_network_subnet_b: Refreshing state... [id=subnet-09a01ba739d3626db]
module.nacl.aws_network_acl.network_acl_private_app_subnet_c: Refreshing state... [id=acl-0e1b68acf28d5393f]
module.nacl.aws_network_acl.network_acl_private_db_subnet_b: Refreshing state... [id=acl-09bb7b8754139a3a6]
module.nacl.aws_network_acl.network_acl_private_db_subnet_c: Refreshing state... [id=acl-0071241c05bbc0c5a]
module.subnet.aws_subnet.private_app_subnet_b: Refreshing state... [id=subnet-0e2a86691c744b727]
module.subnet.aws_subnet.private_app_subnet_a: Refreshing state... [id=subnet-01adee0ee7b434c79]
module.nacl.aws_network_acl.network_acl_private_network_subnet_c: Refreshing state... [id=acl-0451690e23ef54e5a]
module.subnet.aws_subnet.private_db_subnet_a: Refreshing state... [id=subnet-0d15c82f8eb67a6da]
module.nacl.aws_network_acl.network_acl_public_subnet_a: Refreshing state... [id=acl-0694668a6e8df9613]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.nacl.aws_network_acl.network_acl_vpc has changed
  ~ resource "aws_network_acl" "network_acl_vpc" {
        id         = "acl-028ddc3a37f331e01"
      + tags       = {}
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.nacl.aws_network_acl.network_acl_private_app_subnet_a will be destroyed
  # (because aws_network_acl.network_acl_private_app_subnet_a is not in configuration)
  - resource "aws_network_acl" "network_acl_private_app_subnet_a" {
      - arn        = "arn:aws:ec2:ap-southeast-1:894767461064:network-acl/acl-0356c8c1c2820b79f" -> null
      - egress     = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - id         = "acl-0356c8c1c2820b79f" -> null
      - ingress    = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - owner_id   = "894767461064" -> null
      - subnet_ids = [
          - "subnet-01adee0ee7b434c79",
        ] -> null
      - tags       = {
          - "Name" = "PrivateAppSubnetA-NACL"
          - "Tier" = "App"
        } -> null
      - tags_all   = {
          - "Name" = "PrivateAppSubnetA-NACL"
          - "Tier" = "App"
        } -> null
      - vpc_id     = "vpc-01908caf7c73d412a" -> null
    }

  # module.nacl.aws_network_acl.network_acl_private_app_subnet_b will be destroyed
  # (because aws_network_acl.network_acl_private_app_subnet_b is not in configuration)
  - resource "aws_network_acl" "network_acl_private_app_subnet_b" {
      - arn        = "arn:aws:ec2:ap-southeast-1:894767461064:network-acl/acl-0d9d1dbec0a8521fd" -> null
      - egress     = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - id         = "acl-0d9d1dbec0a8521fd" -> null
      - ingress    = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - owner_id   = "894767461064" -> null
      - subnet_ids = [
          - "subnet-0e2a86691c744b727",
        ] -> null
      - tags       = {
          - "Name" = "PrivateAppSubnetB-NACL"
          - "Tier" = "App"
        } -> null
      - tags_all   = {
          - "Name" = "PrivateAppSubnetB-NACL"
          - "Tier" = "App"
        } -> null
      - vpc_id     = "vpc-01908caf7c73d412a" -> null
    }

  # module.nacl.aws_network_acl.network_acl_private_app_subnet_c will be destroyed
  # (because aws_network_acl.network_acl_private_app_subnet_c is not in configuration)
  - resource "aws_network_acl" "network_acl_private_app_subnet_c" {
      - arn        = "arn:aws:ec2:ap-southeast-1:894767461064:network-acl/acl-0e1b68acf28d5393f" -> null
      - egress     = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - id         = "acl-0e1b68acf28d5393f" -> null
      - ingress    = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - owner_id   = "894767461064" -> null
      - subnet_ids = [
          - "subnet-0e3375e07d7b2ee83",
        ] -> null
      - tags       = {
          - "Name" = "PrivateAppSubnetC-NACL"
          - "Tier" = "App"
        } -> null
      - tags_all   = {
          - "Name" = "PrivateAppSubnetC-NACL"
          - "Tier" = "App"
        } -> null
      - vpc_id     = "vpc-01908caf7c73d412a" -> null
    }

  # module.nacl.aws_network_acl.network_acl_private_db_subnet_a will be destroyed
  # (because aws_network_acl.network_acl_private_db_subnet_a is not in configuration)
  - resource "aws_network_acl" "network_acl_private_db_subnet_a" {
      - arn        = "arn:aws:ec2:ap-southeast-1:894767461064:network-acl/acl-0abd79b3f151ae1fe" -> null
      - egress     = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - id         = "acl-0abd79b3f151ae1fe" -> null
      - ingress    = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - owner_id   = "894767461064" -> null
      - subnet_ids = [
          - "subnet-0d15c82f8eb67a6da",
        ] -> null
      - tags       = {
          - "Name" = "PrivateDBSubnetA-NACL"
          - "Tier" = "DB"
        } -> null
      - tags_all   = {
          - "Name" = "PrivateDBSubnetA-NACL"
          - "Tier" = "DB"
        } -> null
      - vpc_id     = "vpc-01908caf7c73d412a" -> null
    }

  # module.nacl.aws_network_acl.network_acl_private_db_subnet_b will be destroyed
  # (because aws_network_acl.network_acl_private_db_subnet_b is not in configuration)
  - resource "aws_network_acl" "network_acl_private_db_subnet_b" {
      - arn        = "arn:aws:ec2:ap-southeast-1:894767461064:network-acl/acl-09bb7b8754139a3a6" -> null
      - egress     = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - id         = "acl-09bb7b8754139a3a6" -> null
      - ingress    = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - owner_id   = "894767461064" -> null
      - subnet_ids = [
          - "subnet-091034298968c903a",
        ] -> null
      - tags       = {
          - "Name" = "PrivateDBSubnetB-NACL"
          - "Tier" = "DB"
        } -> null
      - tags_all   = {
          - "Name" = "PrivateDBSubnetB-NACL"
          - "Tier" = "DB"
        } -> null
      - vpc_id     = "vpc-01908caf7c73d412a" -> null
    }

  # module.nacl.aws_network_acl.network_acl_private_db_subnet_c will be destroyed
  # (because aws_network_acl.network_acl_private_db_subnet_c is not in configuration)
  - resource "aws_network_acl" "network_acl_private_db_subnet_c" {
      - arn        = "arn:aws:ec2:ap-southeast-1:894767461064:network-acl/acl-0071241c05bbc0c5a" -> null
      - egress     = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - id         = "acl-0071241c05bbc0c5a" -> null
      - ingress    = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - owner_id   = "894767461064" -> null
      - subnet_ids = [
          - "subnet-0f4c2b6a6d64eb3a0",
        ] -> null
      - tags       = {
          - "Name" = "PrivateDBSubnetC-NACL"
          - "Tier" = "DB"
        } -> null
      - tags_all   = {
          - "Name" = "PrivateDBSubnetC-NACL"
          - "Tier" = "DB"
        } -> null
      - vpc_id     = "vpc-01908caf7c73d412a" -> null
    }

  # module.nacl.aws_network_acl.network_acl_private_network_subnet_a will be destroyed
  # (because aws_network_acl.network_acl_private_network_subnet_a is not in configuration)
  - resource "aws_network_acl" "network_acl_private_network_subnet_a" {
      - arn        = "arn:aws:ec2:ap-southeast-1:894767461064:network-acl/acl-0e341455acfc523da" -> null
      - egress     = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - id         = "acl-0e341455acfc523da" -> null
      - ingress    = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - owner_id   = "894767461064" -> null
      - subnet_ids = [
          - "subnet-0a2d0351da9e992c1",
        ] -> null
      - tags       = {
          - "Name" = "PrivateNetworkSubnetA-NACL"
          - "Tier" = "Network"
        } -> null
      - tags_all   = {
          - "Name" = "PrivateNetworkSubnetA-NACL"
          - "Tier" = "Network"
        } -> null
      - vpc_id     = "vpc-01908caf7c73d412a" -> null
    }

  # module.nacl.aws_network_acl.network_acl_private_network_subnet_b will be destroyed
  # (because aws_network_acl.network_acl_private_network_subnet_b is not in configuration)
  - resource "aws_network_acl" "network_acl_private_network_subnet_b" {
      - arn        = "arn:aws:ec2:ap-southeast-1:894767461064:network-acl/acl-0a327d4c5b4c7206b" -> null
      - egress     = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - id         = "acl-0a327d4c5b4c7206b" -> null
      - ingress    = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - owner_id   = "894767461064" -> null
      - subnet_ids = [
          - "subnet-09a01ba739d3626db",
        ] -> null
      - tags       = {
          - "Name" = "PrivateNetworkSubnetB-NACL"
          - "Tier" = "Network"
        } -> null
      - tags_all   = {
          - "Name" = "PrivateNetworkSubnetB-NACL"
          - "Tier" = "Network"
        } -> null
      - vpc_id     = "vpc-01908caf7c73d412a" -> null
    }

  # module.nacl.aws_network_acl.network_acl_private_network_subnet_c will be destroyed
  # (because aws_network_acl.network_acl_private_network_subnet_c is not in configuration)
  - resource "aws_network_acl" "network_acl_private_network_subnet_c" {
      - arn        = "arn:aws:ec2:ap-southeast-1:894767461064:network-acl/acl-0451690e23ef54e5a" -> null
      - egress     = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - id         = "acl-0451690e23ef54e5a" -> null
      - ingress    = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - owner_id   = "894767461064" -> null
      - subnet_ids = [
          - "subnet-0d2fdb3dacb6963d8",
        ] -> null
      - tags       = {
          - "Name" = "PrivateNetworkSubnetC-NACL"
          - "Tier" = "Network"
        } -> null
      - tags_all   = {
          - "Name" = "PrivateNetworkSubnetC-NACL"
          - "Tier" = "Network"
        } -> null
      - vpc_id     = "vpc-01908caf7c73d412a" -> null
    }

  # module.nacl.aws_network_acl.network_acl_public_subnet_a will be destroyed
  # (because aws_network_acl.network_acl_public_subnet_a is not in configuration)
  - resource "aws_network_acl" "network_acl_public_subnet_a" {
      - arn        = "arn:aws:ec2:ap-southeast-1:894767461064:network-acl/acl-0694668a6e8df9613" -> null
      - egress     = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - id         = "acl-0694668a6e8df9613" -> null
      - ingress    = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - owner_id   = "894767461064" -> null
      - subnet_ids = [
          - "subnet-005510955b3598a08",
        ] -> null
      - tags       = {
          - "Name" = "PublicSubnetA-NACL"
          - "Tier" = "Public"
        } -> null
      - tags_all   = {
          - "Name" = "PublicSubnetA-NACL"
          - "Tier" = "Public"
        } -> null
      - vpc_id     = "vpc-01908caf7c73d412a" -> null
    }

  # module.nacl.aws_network_acl.network_acl_public_subnet_b will be destroyed
  # (because aws_network_acl.network_acl_public_subnet_b is not in configuration)
  - resource "aws_network_acl" "network_acl_public_subnet_b" {
      - arn        = "arn:aws:ec2:ap-southeast-1:894767461064:network-acl/acl-072f4ac4eb19b9d21" -> null
      - egress     = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - id         = "acl-072f4ac4eb19b9d21" -> null
      - ingress    = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - owner_id   = "894767461064" -> null
      - subnet_ids = [
          - "subnet-0d875761e968b6dfc",
        ] -> null
      - tags       = {
          - "Name" = "PublicSubnetB-NACL"
          - "Tier" = "Public"
        } -> null
      - tags_all   = {
          - "Name" = "PublicSubnetB-NACL"
          - "Tier" = "Public"
        } -> null
      - vpc_id     = "vpc-01908caf7c73d412a" -> null
    }

  # module.nacl.aws_network_acl.network_acl_public_subnet_c will be destroyed
  # (because aws_network_acl.network_acl_public_subnet_c is not in configuration)
  - resource "aws_network_acl" "network_acl_public_subnet_c" {
      - arn        = "arn:aws:ec2:ap-southeast-1:894767461064:network-acl/acl-0efd8c5591b602e4d" -> null
      - egress     = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - id         = "acl-0efd8c5591b602e4d" -> null
      - ingress    = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - owner_id   = "894767461064" -> null
      - subnet_ids = [
          - "subnet-0d4d72d0aaf2e144d",
        ] -> null
      - tags       = {
          - "Name" = "PublicSubnetC-NACL"
          - "Tier" = "Public"
        } -> null
      - tags_all   = {
          - "Name" = "PublicSubnetC-NACL"
          - "Tier" = "Public"
        } -> null
      - vpc_id     = "vpc-01908caf7c73d412a" -> null
    }

  # module.nacl.aws_network_acl.network_acl_vpc will be destroyed
  # (because aws_network_acl.network_acl_vpc is not in configuration)
  - resource "aws_network_acl" "network_acl_vpc" {
      - arn        = "arn:aws:ec2:ap-southeast-1:894767461064:network-acl/acl-028ddc3a37f331e01" -> null
      - egress     = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - id         = "acl-028ddc3a37f331e01" -> null
      - ingress    = [
          - {
              - action          = "allow"
              - cidr_block      = "0.0.0.0/0"
              - from_port       = 0
              - icmp_code       = 0
              - icmp_type       = 0
              - ipv6_cidr_block = ""
              - protocol        = "-1"
              - rule_no         = 100
              - to_port         = 0
            },
        ] -> null
      - owner_id   = "894767461064" -> null
      - subnet_ids = [] -> null
      - tags       = {} -> null
      - tags_all   = {} -> null
      - vpc_id     = "vpc-01908caf7c73d412a" -> null
    }

  # module.network.aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "main"
        }
      + tags_all = {
          + "Name" = "main"
        }
      + vpc_id   = (known after apply)
    }

  # module.network.aws_network_acl.network_acl_private_app_subnet[0] will be created
  + resource "aws_network_acl" "network_acl_private_app_subnet" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "PrivateAppSubnet-0-NACL"
          + "Tier" = "App"
        }
      + tags_all   = {
          + "Name" = "PrivateAppSubnet-0-NACL"
          + "Tier" = "App"
        }
      + vpc_id     = (known after apply)
    }

  # module.network.aws_network_acl.network_acl_private_app_subnet[1] will be created
  + resource "aws_network_acl" "network_acl_private_app_subnet" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "PrivateAppSubnet-1-NACL"
          + "Tier" = "App"
        }
      + tags_all   = {
          + "Name" = "PrivateAppSubnet-1-NACL"
          + "Tier" = "App"
        }
      + vpc_id     = (known after apply)
    }

  # module.network.aws_network_acl.network_acl_private_app_subnet[2] will be created
  + resource "aws_network_acl" "network_acl_private_app_subnet" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "PrivateAppSubnet-2-NACL"
          + "Tier" = "App"
        }
      + tags_all   = {
          + "Name" = "PrivateAppSubnet-2-NACL"
          + "Tier" = "App"
        }
      + vpc_id     = (known after apply)
    }

  # module.network.aws_network_acl.network_acl_private_db_subnet[0] will be created
  + resource "aws_network_acl" "network_acl_private_db_subnet" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "PrivateDBSubnet-0-NACL"
          + "Tier" = "DB"
        }
      + tags_all   = {
          + "Name" = "PrivateDBSubnet-0-NACL"
          + "Tier" = "DB"
        }
      + vpc_id     = (known after apply)
    }

  # module.network.aws_network_acl.network_acl_private_db_subnet[1] will be created
  + resource "aws_network_acl" "network_acl_private_db_subnet" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "PrivateDBSubnet-1-NACL"
          + "Tier" = "DB"
        }
      + tags_all   = {
          + "Name" = "PrivateDBSubnet-1-NACL"
          + "Tier" = "DB"
        }
      + vpc_id     = (known after apply)
    }

  # module.network.aws_network_acl.network_acl_private_db_subnet[2] will be created
  + resource "aws_network_acl" "network_acl_private_db_subnet" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "PrivateDBSubnet-2-NACL"
          + "Tier" = "DB"
        }
      + tags_all   = {
          + "Name" = "PrivateDBSubnet-2-NACL"
          + "Tier" = "DB"
        }
      + vpc_id     = (known after apply)
    }

  # module.network.aws_network_acl.network_acl_private_network_subnet[0] will be created
  + resource "aws_network_acl" "network_acl_private_network_subnet" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "PrivateNetworkSubnet-0-NACL"
          + "Tier" = "Network"
        }
      + tags_all   = {
          + "Name" = "PrivateNetworkSubnet-0-NACL"
          + "Tier" = "Network"
        }
      + vpc_id     = (known after apply)
    }

  # module.network.aws_network_acl.network_acl_private_network_subnet[1] will be created
  + resource "aws_network_acl" "network_acl_private_network_subnet" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "PrivateNetworkSubnet-1-NACL"
          + "Tier" = "Network"
        }
      + tags_all   = {
          + "Name" = "PrivateNetworkSubnet-1-NACL"
          + "Tier" = "Network"
        }
      + vpc_id     = (known after apply)
    }

  # module.network.aws_network_acl.network_acl_private_network_subnet[2] will be created
  + resource "aws_network_acl" "network_acl_private_network_subnet" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "PrivateNetworkSubnet-2-NACL"
          + "Tier" = "Network"
        }
      + tags_all   = {
          + "Name" = "PrivateNetworkSubnet-2-NACL"
          + "Tier" = "Network"
        }
      + vpc_id     = (known after apply)
    }

  # module.network.aws_network_acl.network_acl_public_subnet[0] will be created
  + resource "aws_network_acl" "network_acl_public_subnet" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "PublicSubnet-0-NACL"
          + "Tier" = "Public"
        }
      + tags_all   = {
          + "Name" = "PublicSubnet-0-NACL"
          + "Tier" = "Public"
        }
      + vpc_id     = (known after apply)
    }

  # module.network.aws_network_acl.network_acl_public_subnet[1] will be created
  + resource "aws_network_acl" "network_acl_public_subnet" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "PublicSubnet-1-NACL"
          + "Tier" = "Public"
        }
      + tags_all   = {
          + "Name" = "PublicSubnet-1-NACL"
          + "Tier" = "Public"
        }
      + vpc_id     = (known after apply)
    }

  # module.network.aws_network_acl.network_acl_public_subnet[2] will be created
  + resource "aws_network_acl" "network_acl_public_subnet" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "PublicSubnet-2-NACL"
          + "Tier" = "Public"
        }
      + tags_all   = {
          + "Name" = "PublicSubnet-2-NACL"
          + "Tier" = "Public"
        }
      + vpc_id     = (known after apply)
    }

  # module.network.aws_network_acl.network_acl_vpc will be created
  + resource "aws_network_acl" "network_acl_vpc" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = 0
              + icmp_type       = 0
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags_all   = (known after apply)
      + vpc_id     = (known after apply)
    }

  # module.network.aws_subnet.private_app_subnet[0] will be created
  + resource "aws_subnet" "private_app_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.7.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "PrivateAppSubnet-0"
          + "Tier" = "App"
        }
      + tags_all                                       = {
          + "Name" = "PrivateAppSubnet-0"
          + "Tier" = "App"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private_app_subnet[1] will be created
  + resource "aws_subnet" "private_app_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.8.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "PrivateAppSubnet-1"
          + "Tier" = "App"
        }
      + tags_all                                       = {
          + "Name" = "PrivateAppSubnet-1"
          + "Tier" = "App"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private_app_subnet[2] will be created
  + resource "aws_subnet" "private_app_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.9.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "PrivateAppSubnet-2"
          + "Tier" = "App"
        }
      + tags_all                                       = {
          + "Name" = "PrivateAppSubnet-2"
          + "Tier" = "App"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private_db_subnet[0] will be created
  + resource "aws_subnet" "private_db_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "PrivateDBSubnet-0"
          + "Tier" = "DB"
        }
      + tags_all                                       = {
          + "Name" = "PrivateDBSubnet-0"
          + "Tier" = "DB"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private_db_subnet[1] will be created
  + resource "aws_subnet" "private_db_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "PrivateDBSubnet-1"
          + "Tier" = "DB"
        }
      + tags_all                                       = {
          + "Name" = "PrivateDBSubnet-1"
          + "Tier" = "DB"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private_db_subnet[2] will be created
  + resource "aws_subnet" "private_db_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "PrivateDBSubnet-2"
          + "Tier" = "DB"
        }
      + tags_all                                       = {
          + "Name" = "PrivateDBSubnet-2"
          + "Tier" = "DB"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private_network_subnet[0] will be created
  + resource "aws_subnet" "private_network_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "PrivateNetworkSubnet-0"
          + "Tier" = "Network"
        }
      + tags_all                                       = {
          + "Name" = "PrivateNetworkSubnet-0"
          + "Tier" = "Network"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private_network_subnet[1] will be created
  + resource "aws_subnet" "private_network_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "PrivateNetworkSubnet-1"
          + "Tier" = "Network"
        }
      + tags_all                                       = {
          + "Name" = "PrivateNetworkSubnet-1"
          + "Tier" = "Network"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private_network_subnet[2] will be created
  + resource "aws_subnet" "private_network_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "PrivateNetworkSubnet-2"
          + "Tier" = "Network"
        }
      + tags_all                                       = {
          + "Name" = "PrivateNetworkSubnet-2"
          + "Tier" = "Network"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public_subnet[0] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "PublicSubnet-0"
          + "Tier" = "Public"
        }
      + tags_all                                       = {
          + "Name" = "PublicSubnet-0"
          + "Tier" = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public_subnet[1] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "PublicSubnet-1"
          + "Tier" = "Public"
        }
      + tags_all                                       = {
          + "Name" = "PublicSubnet-1"
          + "Tier" = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.public_subnet[2] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.31.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = "ip-name"
      + tags                                           = {
          + "Name" = "PublicSubnet-2"
          + "Tier" = "Public"
        }
      + tags_all                                       = {
          + "Name" = "PublicSubnet-2"
          + "Tier" = "Public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "172.31.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = false
      + enable_classiclink_dns_support       = false
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "main-vpc"
        }
      + tags_all                             = {
          + "Name" = "main-vpc"
        }
    }

  # module.subnet.aws_subnet.private_app_subnet_a will be destroyed
  # (because aws_subnet.private_app_subnet_a is not in configuration)
  - resource "aws_subnet" "private_app_subnet_a" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:894767461064:subnet/subnet-01adee0ee7b434c79" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1b" -> null
      - availability_zone_id                           = "apse1-az2" -> null
      - cidr_block                                     = "172.31.112.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-01adee0ee7b434c79" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "894767461064" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "PrivateAppSubnetA"
          - "Tier" = "App"
        } -> null
      - tags_all                                       = {
          - "Name" = "PrivateAppSubnetA"
          - "Tier" = "App"
        } -> null
      - vpc_id                                         = "vpc-01908caf7c73d412a" -> null
    }

  # module.subnet.aws_subnet.private_app_subnet_b will be destroyed
  # (because aws_subnet.private_app_subnet_b is not in configuration)
  - resource "aws_subnet" "private_app_subnet_b" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:894767461064:subnet/subnet-0e2a86691c744b727" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1a" -> null
      - availability_zone_id                           = "apse1-az1" -> null
      - cidr_block                                     = "172.31.128.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0e2a86691c744b727" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "894767461064" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "PrivateAppSubnetB"
          - "Tier" = "App"
        } -> null
      - tags_all                                       = {
          - "Name" = "PrivateAppSubnetB"
          - "Tier" = "App"
        } -> null
      - vpc_id                                         = "vpc-01908caf7c73d412a" -> null
    }

  # module.subnet.aws_subnet.private_app_subnet_c will be destroyed
  # (because aws_subnet.private_app_subnet_c is not in configuration)
  - resource "aws_subnet" "private_app_subnet_c" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:894767461064:subnet/subnet-0e3375e07d7b2ee83" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1b" -> null
      - availability_zone_id                           = "apse1-az2" -> null
      - cidr_block                                     = "172.31.144.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0e3375e07d7b2ee83" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "894767461064" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "PrivateAppSubnetC"
          - "Tier" = "App"
        } -> null
      - tags_all                                       = {
          - "Name" = "PrivateAppSubnetC"
          - "Tier" = "App"
        } -> null
      - vpc_id                                         = "vpc-01908caf7c73d412a" -> null
    }

  # module.subnet.aws_subnet.private_db_subnet_a will be destroyed
  # (because aws_subnet.private_db_subnet_a is not in configuration)
  - resource "aws_subnet" "private_db_subnet_a" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:894767461064:subnet/subnet-0d15c82f8eb67a6da" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1b" -> null
      - availability_zone_id                           = "apse1-az2" -> null
      - cidr_block                                     = "172.31.208.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0d15c82f8eb67a6da" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "894767461064" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "PrivateDBSubnetA"
          - "Tier" = "DB"
        } -> null
      - tags_all                                       = {
          - "Name" = "PrivateDBSubnetA"
          - "Tier" = "DB"
        } -> null
      - vpc_id                                         = "vpc-01908caf7c73d412a" -> null
    }

  # module.subnet.aws_subnet.private_db_subnet_b will be destroyed
  # (because aws_subnet.private_db_subnet_b is not in configuration)
  - resource "aws_subnet" "private_db_subnet_b" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:894767461064:subnet/subnet-091034298968c903a" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1c" -> null
      - availability_zone_id                           = "apse1-az3" -> null
      - cidr_block                                     = "172.31.224.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-091034298968c903a" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "894767461064" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "PrivateDBSubnetB"
          - "Tier" = "DB"
        } -> null
      - tags_all                                       = {
          - "Name" = "PrivateDBSubnetB"
          - "Tier" = "DB"
        } -> null
      - vpc_id                                         = "vpc-01908caf7c73d412a" -> null
    }

  # module.subnet.aws_subnet.private_db_subnet_c will be destroyed
  # (because aws_subnet.private_db_subnet_c is not in configuration)
  - resource "aws_subnet" "private_db_subnet_c" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:894767461064:subnet/subnet-0f4c2b6a6d64eb3a0" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1c" -> null
      - availability_zone_id                           = "apse1-az3" -> null
      - cidr_block                                     = "172.31.240.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0f4c2b6a6d64eb3a0" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "894767461064" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "PrivateDBSubnetC"
          - "Tier" = "DB"
        } -> null
      - tags_all                                       = {
          - "Name" = "PrivateDBSubnetC"
          - "Tier" = "DB"
        } -> null
      - vpc_id                                         = "vpc-01908caf7c73d412a" -> null
    }

  # module.subnet.aws_subnet.private_network_subnet_a will be destroyed
  # (because aws_subnet.private_network_subnet_a is not in configuration)
  - resource "aws_subnet" "private_network_subnet_a" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:894767461064:subnet/subnet-0a2d0351da9e992c1" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1a" -> null
      - availability_zone_id                           = "apse1-az1" -> null
      - cidr_block                                     = "172.31.64.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0a2d0351da9e992c1" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "894767461064" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "PrivateNetworkSubnetA"
          - "Tier" = "Network"
        } -> null
      - tags_all                                       = {
          - "Name" = "PrivateNetworkSubnetA"
          - "Tier" = "Network"
        } -> null
      - vpc_id                                         = "vpc-01908caf7c73d412a" -> null
    }

  # module.subnet.aws_subnet.private_network_subnet_b will be destroyed
  # (because aws_subnet.private_network_subnet_b is not in configuration)
  - resource "aws_subnet" "private_network_subnet_b" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:894767461064:subnet/subnet-09a01ba739d3626db" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1c" -> null
      - availability_zone_id                           = "apse1-az3" -> null
      - cidr_block                                     = "172.31.80.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-09a01ba739d3626db" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "894767461064" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "PrivateNetworkSubnetB"
          - "Tier" = "Network"
        } -> null
      - tags_all                                       = {
          - "Name" = "PrivateNetworkSubnetB"
          - "Tier" = "Network"
        } -> null
      - vpc_id                                         = "vpc-01908caf7c73d412a" -> null
    }

  # module.subnet.aws_subnet.private_network_subnet_c will be destroyed
  # (because aws_subnet.private_network_subnet_c is not in configuration)
  - resource "aws_subnet" "private_network_subnet_c" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:894767461064:subnet/subnet-0d2fdb3dacb6963d8" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1c" -> null
      - availability_zone_id                           = "apse1-az3" -> null
      - cidr_block                                     = "172.31.96.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0d2fdb3dacb6963d8" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "894767461064" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "PrivateNetworkSubnetC"
          - "Tier" = "Network"
        } -> null
      - tags_all                                       = {
          - "Name" = "PrivateNetworkSubnetC"
          - "Tier" = "Network"
        } -> null
      - vpc_id                                         = "vpc-01908caf7c73d412a" -> null
    }

  # module.subnet.aws_subnet.public_subnet_a will be destroyed
  # (because aws_subnet.public_subnet_a is not in configuration)
  - resource "aws_subnet" "public_subnet_a" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:894767461064:subnet/subnet-005510955b3598a08" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1b" -> null
      - availability_zone_id                           = "apse1-az2" -> null
      - cidr_block                                     = "172.31.16.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-005510955b3598a08" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "894767461064" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "PublicSubnetA"
          - "Tier" = "Public"
        } -> null
      - tags_all                                       = {
          - "Name" = "PublicSubnetA"
          - "Tier" = "Public"
        } -> null
      - vpc_id                                         = "vpc-01908caf7c73d412a" -> null
    }

  # module.subnet.aws_subnet.public_subnet_b will be destroyed
  # (because aws_subnet.public_subnet_b is not in configuration)
  - resource "aws_subnet" "public_subnet_b" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:894767461064:subnet/subnet-0d875761e968b6dfc" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1b" -> null
      - availability_zone_id                           = "apse1-az2" -> null
      - cidr_block                                     = "172.31.32.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0d875761e968b6dfc" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "894767461064" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "PublicSubnetB"
          - "Tier" = "Public"
        } -> null
      - tags_all                                       = {
          - "Name" = "PublicSubnetB"
          - "Tier" = "Public"
        } -> null
      - vpc_id                                         = "vpc-01908caf7c73d412a" -> null
    }

  # module.subnet.aws_subnet.public_subnet_c will be destroyed
  # (because aws_subnet.public_subnet_c is not in configuration)
  - resource "aws_subnet" "public_subnet_c" {
      - arn                                            = "arn:aws:ec2:ap-southeast-1:894767461064:subnet/subnet-0d4d72d0aaf2e144d" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "ap-southeast-1c" -> null
      - availability_zone_id                           = "apse1-az3" -> null
      - cidr_block                                     = "172.31.48.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0d4d72d0aaf2e144d" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "894767461064" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "PublicSubnetC"
          - "Tier" = "Public"
        } -> null
      - tags_all                                       = {
          - "Name" = "PublicSubnetC"
          - "Tier" = "Public"
        } -> null
      - vpc_id                                         = "vpc-01908caf7c73d412a" -> null
    }

  # module.vpc.aws_vpc.controltower_vpc will be destroyed
  # (because aws_vpc.controltower_vpc is not in configuration)
  - resource "aws_vpc" "controltower_vpc" {
      - arn                              = "arn:aws:ec2:ap-southeast-1:894767461064:vpc/vpc-01908caf7c73d412a" -> null
      - assign_generated_ipv6_cidr_block = false -> null
      - cidr_block                       = "172.31.0.0/16" -> null
      - default_network_acl_id           = "acl-0bbd51bf933514089" -> null
      - default_route_table_id           = "rtb-033783d66447319b4" -> null
      - default_security_group_id        = "sg-03131c3b43477cb16" -> null
      - dhcp_options_id                  = "dopt-0b5ca068603c72519" -> null
      - enable_classiclink               = false -> null
      - enable_classiclink_dns_support   = false -> null
      - enable_dns_hostnames             = true -> null
      - enable_dns_support               = true -> null
      - id                               = "vpc-01908caf7c73d412a" -> null
      - instance_tenancy                 = "default" -> null
      - ipv6_netmask_length              = 0 -> null
      - main_route_table_id              = "rtb-033783d66447319b4" -> null
      - owner_id                         = "894767461064" -> null
      - tags                             = {
          - "Name" = "aws-controltower-VPC"
        } -> null
      - tags_all                         = {
          - "Name" = "aws-controltower-VPC"
        } -> null
    }

Plan: 27 to add, 0 to change, 26 to destroy.


```

</details>

*Pusher: @avosalmon, Action: `pull_request`*